app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "8SWsSK/zI24Piw56s16Cgw=="], ["updated_at", "2020-12-04 17:52:23.282840"], ["id", 5]]
---
    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!